export const gameRulesArray = [
  {
    id: '1',
    image: '/img/b_hero.png',
    alt: 'Картинка Бомбермена',
    title: 'Бомбардировщик - главный герой игры.',
  },
  {
    id: '2',
    image: '/img/b_game.png',
    alt: 'Игровое поле',
    title:
      'Игровое поле содержит 2 типа объектов: <hr />\n' +
      '          1. группа динамических объектов (Бомбардировщик, Враг, Бомба), 2.\n' +
      '          группа статических объектов (Трава, Стена, Кирпич, Дверь, Предмет)',
  },
  {
    id: '3',
    image: '/img/b_keys.png',
    alt: 'Кнопки управления игроком',
    title:
      'Игрок может перемещаться только в четырьмя направлениями: вверх, вниз,\n' +
      '          влево и вправо.',
  },
  {
    id: '4',
    image: '/img/b_bomb.png',
    alt: 'Картинка Бомы',
    title:
      'Игрок может выпустить бомбу, которая взорвется через несколько секунд.\n' +
      '          Бомба может разрушить кирпичные стены. Для размещения бомбы\n' +
      '          используйте клавишу SPACE.',
  },
  {
    id: '5',
    image: '/img/b_game_over.png',
    alt: 'Картинка проигрыша',
    title:
      'Игрок должен остерегаться своей собственной бомбы, которая может\n' +
      '          причинить ему ущерб.',
  },
  {
    id: '6',
    image: '/img/b_game_over.png',
    alt: 'Картинка Выигрыша',
    title:
      'Игра заканчивается выигрышем если герой нашел портал и не погиб.\n' +
      '          Лучшее время прохождения игры можно посмотреть на Доске лидеров.',
  },
  {
    id: '7',
    image: '/img/bonuses.png',
    alt: 'Картинка Бонусов',
    title:
      'Игрок может подбирать различные предметы, такие как увеличение\n' +
      '          скорости или увеличение области взрыва.',
  },
]
