export const gameRulesArray = [
  {
    id: '1',
    image: '/img/b_hero1.png',
    alt: 'Картинка Бомбермена',
    title: 'Бомбардировщик - главный герой игры.',
  },
  {
    id: '2',
    image: '/img/b_game.png',
    alt: 'Игровое поле',
    title: `Игровое поле содержит 2 типа объектов: динамическе (Бомбардировщик, Враг, Бомба) и  
    статические (Трава, Стена, Кирпич, Дверь, Предмет).`,
  },
  {
    id: '3',
    image: '/img/b_keys.png',
    alt: 'Кнопки управления игроком',
    title: `Игрок может перемещаться только в четырёх направлениями: вверх, вниз,
      влево и вправо.`,
  },
  {
    id: '4',
    image: '/img/b_bomb.png',
    alt: 'Картинка Бомбы',
    title: `Игрок может выпустить бомбу, которая взорвется через несколько секунд. 
    Бомба может разрушить кирпичные стены. Для размещения бомбы используйте клавишу SPACE.`,
  },
  {
    id: '5',
    image: '/img/b_game_over.png',
    alt: 'Картинка проигрыша',
    title: `Игрок должен остерегаться своей собственной бомбы, которая может 
    причинить ему ущерб. Враги также могут убить.`,
  },
  {
    id: '6',
    image: '/img/b_game_over.png',
    alt: 'Картинка Выигрыша',
    title: `Игра заканчивается выигрышем если герой нашел портал и не погиб. 
    Лучшее время прохождения игры можно посмотреть на Доске лидеров.`,
  },
  {
    id: '7',
    image: '/img/bonuses.png',
    alt: 'Картинка Бонусов',
    title: `Игрок может подбирать различные предметы, такие как увеличение скорости 
    или увеличение области взрыва.`,
  },
]
